OdDAI.Entity.getAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves the current value of an attribute specified by its name.
\param attrName [in] An ANSI string that contains the attribute name.
\returns Returns the current value of the attribute.
\remarks
The method provides the late binding access to the attribute value by its name.
Attributes of select and aggregate data types are also supported.

OdDAI.Entity.appendAttribute(OdSmartPtr&lt;OdDAI.Attribute&gt;)
\details
Appends a new attribute definition to the entity definitioin.
\param attributeDef [in] A smart pointer to an attribute definition to be added.

OdDAI.Entity.instantiable
\details
Retrieves whether the entity definition can be instantiated or not.
\returns Returns true if the entity definition can be instantiated; otherwise, the method returns false.

OdDAI.Entity.isSupertypeOf(OdDAI.Entity!System.Runtime.CompilerServices.IsConst*)
\details
Check if current Entity is a supertype of another entity.
\param subtypeToCheck [in] Entity subtype to check
\returns true if current object is supertype of subtypeToCheck and false in other case.

OdDAI.Entity.supertypes
\details
Retrieves the current list of the entity definition's supertypes.
\returns Returns an STD list of the entity definition's supertypes.

OdDAI.Entity.attributes
\details
Retrieves the current list of attribute definitions for the entity definition.
\returns Returns the array of attribute definitions.
\remarks
The attributes definitions of the superclass entity definition are not included in the resulting array.

OdDAI.Entity.createObject(OdDAI.Schema*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,System.Boolean)
\details
Creates a new entity definition with a specified owning schema, name instantiable values.
\param owningSchema [in] Schema in which entity definition is declared.
\param entityName   [in] An entity definition name.
\param instantiable [in] A flag that defines whether the entity can be instantiated (equal to true) or not (equal to false).
\returns Returns a smart pointer to the created entity.

OdDAI.Entity.#ctor(OdAnsiString,System.Boolean)
\details
Creates a new entity definition with specified parameters.
\param name [in] A new entity definition name.
\param instantiable [in] A flag that defines whether the entity can be instantiated (equal to true) or not (equal to false).